import numpy as np
import matplotlib.pyplot as plt
from matplotlib.animation import FuncAnimation

# Параметры окружности
cx = 0.170000
cy = 0.000000
R = 0.050000

# Подсчет точек окружности
theta = np.linspace(0, 2*np.pi, 200)
x_circle = cx + R * np.cos(theta)
y_circle = cy + R * np.sin(theta)

x_vals_1 = np.array([0.0030, 0.0060, 0.0090, 0.0120, 0.0150, 0.0180, 0.0210, 0.0240, 0.0270, 0.0300, 0.0330, 0.0360, 0.0390, 0.0420, 0.0450, 0.0480, 0.0510, 0.0540, 0.0570, 0.0600, 0.0630, 0.0660, 0.0690, 0.0720, 0.0750, 0.0780, 0.0810, 0.0840, 0.0870, 0.0900, 0.0930, 0.0960, 0.0990, 0.1020, 0.1050, 0.1080, 0.1110, 0.1140, 0.1170, 0.1200, 0.1230, 0.1263, 0.1299, 0.1338, 0.1378, 0.1422, 0.1466, 0.1513, 0.1560, 0.1609, 0.1658, 0.1707, 0.1757, 0.1806, 0.1854, 0.1901, 0.1947, 0.1991, 0.2034, 0.2074, 0.2112, 0.2147, 0.2179, 0.2208, 0.2237, 0.2266, 0.2295, 0.2324, 0.2354, 0.2383, 0.2412, 0.2441, 0.2470, 0.2499, 0.2528, 0.2557, 0.2586, 0.2615, 0.2644, 0.2673, 0.2702, 0.2731, 0.2760, 0.2789, 0.2818, 0.2847, 0.2876, 0.2905, 0.2934, 0.2964, 0.2993, 0.3022, 0.3051, 0.3080, 0.3109, 0.3138, 0.3167, 0.3196, 0.3225, 0.3254])
y_vals_1 = np.array([0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0100, 0.0099, 0.0098, 0.0096, 0.0094, 0.0090, 0.0087, 0.0082, 0.0077, 0.0072, 0.0066, 0.0060, 0.0053, 0.0046, 0.0039, 0.0031, 0.0023, 0.0015, 0.0007, -0.0001, -0.0009, -0.0017, -0.0025, -0.0032, -0.0040, -0.0048, -0.0056, -0.0063, -0.0071, -0.0079, -0.0087, -0.0094, -0.0102, -0.0110, -0.0118, -0.0126, -0.0133, -0.0141, -0.0149, -0.0157, -0.0164, -0.0172, -0.0180, -0.0188, -0.0195, -0.0203, -0.0211, -0.0219, -0.0226, -0.0234, -0.0242, -0.0250, -0.0257, -0.0265, -0.0273, -0.0281, -0.0288, -0.0296, -0.0304, -0.0312])
fig, ax = plt.subplots(figsize=(10, 6))
ax.set_xlim(min(x_vals_1), max(x_vals_1))
ax.set_ylim(min(y_vals_1), max(y_vals_1))
ax.set_xlabel("x")
ax.set_ylabel("y")
ax.grid(True)

# Отрисовка окружности
circle_line, = ax.plot(x_circle, y_circle, linestyle='--', color='orange', linewidth=2)

#Создание фигур
line1,  = ax.plot([], [], linewidth=2)
point1, = ax.plot([], [], 'ro', markersize=8)

#Инициализация
def init():
	line1.set_data([], [])
	point1.set_data([], [])

	return line1, point1

#Обновление кадра
def update(frame):
	line1.set_data(x_vals_1[:frame+1], y_vals_1[:frame+1])
	point1.set_data([x_vals_1[frame]], [y_vals_1[frame]])
	return line1, point1

#Создание анимации
ani = FuncAnimation(
	fig,
	update,
	frames=len(x_vals_1),
	init_func=init,
	interval=10,
	blit=True
)

#Сохранение анимации
ani.save("parabola.mp4", writer="ffmpeg", fps=100)
